app/controllers/reports_controller.rb

  def create
    @report = Report.new(report_params)

    respond_to do |format|
      if @report.save
---
INSERT INTO "reports" ("agenteAjustador", "anoVehiculo", "colorVehiculo", "comentarioGeneral", "comentarioSecundario", "companiaSeguros", "condicionesEspeciales", "created_at", "emailAsegurado", "equipoEspecialAmparado", "estatusCobranza", "fechaSiniestro", "foto1", "foto2", "foto3", "horarioContacto", "marcaVehiculo", "modeloVehiculo", "montoDeducible", "noInciso", "noMotor", "noPoliza", "noSerie", "noSiniestro", "nombreAsegurado", "nombreTerceroAfectado", "numeroTelefono", "placasVehiculo", "porcentajeDeducible", "requiereGrua", "sigueAuto", "siniestro", "terceroAsegurado", "tipoVehiculo", "updated_at", "valorComercial") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32, $33, $34, $35, $36) RETURNING "id"

    def set_report
      @report = Report.find(params[:id])
---
SELECT "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT 1  [["id", "3"]]