app/controllers/reportes_controller.rb

SELECT "reportes".* FROM "reportes"
---
  def index
    @reportes = Reporte.all

INSERT INTO "reportes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Sat, 26 Apr 2014 03:33:18 UTC +00:00], ["updated_at", Sat, 26 Apr 2014 03:33:18 UTC +00:00]]
---
  def create
    @reporte = Reporte.new(reporte_params)

    respond_to do |format|
      if @reporte.save

DELETE FROM "reportes" WHERE "reportes"."id" = $1  [["id", 1]]
---
  def destroy
    @reporte.destroy

SELECT "reportes".* FROM "reportes" WHERE "reportes"."id" = $1 LIMIT 1  [["id", "2"]]
---
    def set_reporte
      @reporte = Reporte.find(params[:id])